src/cf/InformationRegisters/вогКонтактныеЛицаПодписанты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<InformationRegister>
		<Properties>
			<Name>вогКонтактныеЛицаПодписанты</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыОснованийПодписанта</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодДействияС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодДействияПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>КонтактноеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛицаПартнеров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЮридическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.вогЮридическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/вогКонтактныеЛицаПодписанты/Ext/ManagerModule.bsl
//++ VOG Иванов С.А. 29.10.2019 ID заявки: 000000775
Процедура СоздатьЗаписьПодписантаКонтактногоЛица(СтруктураЗаписи) Экспорт
	
	НаборЗаписей = РегистрыСведений.вогКонтактныеЛицаПодписанты.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.КонтактноеЛицо.Установить(СтруктураЗаписи.КонтактноеЛицо);
	НаборЗаписей.Отбор.ЮридическоеЛицо.Установить(СтруктураЗаписи.ОбъектСвязи);
	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество() Тогда
		Возврат;
	КонецЕсли;
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Период                  = ?(СтруктураЗаписи.Свойство("Период"), СтруктураЗаписи.Период, ТекущаяДатаСеанса());
	НоваяЗапись.КонтактноеЛицо          = СтруктураЗаписи.КонтактноеЛицо; 
	НоваяЗапись.ЮридическоеЛицо         = СтруктураЗаписи.ОбъектСвязи; 
	НоваяЗапись.Основание               = ?(СтруктураЗаписи.Свойство("Основание"), СтруктураЗаписи.Основание, Перечисления.ВариантыОснованийПодписанта.ПустаяСсылка()); 
	НоваяЗапись.Номер                   = ?(СтруктураЗаписи.Свойство("Номер"), СтруктураЗаписи.Номер, "");
	НоваяЗапись.ДатаДокумента        = ?(СтруктураЗаписи.Свойство("ДатаДокумента"), СтруктураЗаписи.ДатаДокумента, Дата('00010101'));
	НоваяЗапись.ПериодДействияС         = ?(СтруктураЗаписи.Свойство("ПериодДействияС"), СтруктураЗаписи.ПериодДействияС, Дата('00010101'));
	НоваяЗапись.ПериодДействияПо        = ?(СтруктураЗаписи.Свойство("ПериодДействияПо"), СтруктураЗаписи.ПериодДействияПо, Дата('00010101'));
	
	НаборЗаписей.Записать();
КонецПроцедуры
//-- VOG Иванов С.А. 29.10.2019 ID заявки: 000000775
